run/Axial_Stage_MRF_rotating/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 2250;

boundaryField
{
    inlet_0
    {
        type            compressible::turbulentMixingLengthFrequencyInlet;
        mixingLength    0.05;
        k               k;
        value           uniform 2250;
    }
    outlet_0
    {
        type            overlapGgi;
        value           uniform 2250;
    }
    passageSidesUpper_0
    {
        type            cyclicGgi;
        value           uniform 2250;
    }
    passageSidesLower_0
    {
        type            cyclicGgi;
        value           uniform 2250;
    }
    hub_0
    {
        type            compressible::omegaWallFunction;
        U               URel;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        beta1           0.075;
        value           uniform 2250;
    }
    shroud_0
    {
        type            compressible::omegaWallFunction;
        U               URel;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        beta1           0.075;
        value           uniform 2250;
    }
    blade_0
    {
        type            compressible::omegaWallFunction;
        U               URel;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        beta1           0.075;
        value           uniform 2250;
    }
    inlet_1
    {
        type            overlapGgi;
        value           uniform 2250;
    }
    outlet_1
    {
        type            zeroGradient;
    }
    passageSidesUpper_1
    {
        type            cyclicGgi;
        value           uniform 2250;
    }
    passageSidesLower_1
    {
        type            cyclicGgi;
        value           uniform 2250;
    }
    hub_1
    {
        type            compressible::omegaWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        beta1           0.075;
        value           uniform 2250;
    }
    shroud_1
    {
        type            compressible::omegaWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        beta1           0.075;
        value           uniform 2250;
    }
    blade_1
    {
        type            compressible::omegaWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        beta1           0.075;
        value           uniform 2250;
    }
}


// ************************************************************************* //
