run/Axial_Stage_MRF_rotating/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

#runApplication blockMesh
runApplication setSet -batch setBatch
runApplication regionCellSets
runApplication setsToZones -noFlipMap


runApplication transonicMRFDyMFoam

# ----------------------------------------------------------------- end-of-file


