run/Axial_Stage_MRF_rotating/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default backwardDual physDeltaT CoDeltaT;
    /*
    ddt(rho)       EulerLocal physDeltaT CoDeltaT;
    ddt(rhoU)      EulerLocal physDeltaT CoDeltaT;
    ddt(rhoE)      EulerLocal physDeltaT CoDeltaT;
    ddt(rho,omega) EulerLocal physDeltaT CoDeltaT;
    ddt(rho,k)     EulerLocal physDeltaT CoDeltaT;
    */
}

gradSchemes
{
    default         Gauss linear;
//     grad(rho)       Gauss linear;
//     grad(rhoU)      leastSquares;
//     grad(rhoE)      leastSquares;
//     grad(p)         leastSquares;
//     grad(U)         leastSquares;
//     grad(T)         leastSquares;
//     snGradCorr(U)   leastSquares;
//     snGradCorr(h)   leastSquares;
//
//     grad(URel)   leastSquares;
//
//     snGradCorr(omega)   leastSquares;
//     snGradCorr(k)       leastSquares;
//     grad(omega)         leastSquares;
//     grad(k)             leastSquares;
}

divSchemes
{
    default         none;
//     div(tau)        Gauss upwind phi;
//     div((tau&U))    Gauss upwind phi;
//     div(phi,omega)  Gauss upwind;
//     div(phi,k)      Gauss upwind;

    div(tau)        Gauss linear;
    div((tau&U))    Gauss linear;
    div(phi,omega)  Gauss upwind;
    div(phi,k)      Gauss upwind;
}

laplacianSchemes
{
    default         none;
    laplacian(alphaEff,h)      Gauss linear corrected;
    laplacian(DomegaEff,omega) Gauss linear corrected;
    laplacian(DkEff,k)         Gauss linear corrected;
    laplacian((mu+(0.6*mut)),k) Gauss linear corrected;
}

interpolationSchemes
{
    default               none;
    interpolate(rho)      linear corrected;
}

fluxRequired
{
    default         no;
}

// ************************************************************************* //
