run/Axial_Stage_MRF_rotating/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {
        solver          diagonal;
    };

    rhoU
    {
        solver          diagonal;
    };

    rhoE
    {
        solver          diagonal;
    };

    omega
    {
        solver           PBiCG;
        preconditioner   DILU;
        tolerance        1e-08;
        relTol           0;
    };

    k
    {
        solver           PBiCG;
        preconditioner   DILU;
        tolerance        1e-08;
        relTol           0;
    };
}

multiStage
{
    numberSubCycles        50;
    numberRungeKuttaStages 4;
    RKCoeff 0.11 0.2766 0.5 1.0;
}

Riemann
{
    secondOrder yes;            // activate 2nd order extensions
    multidimLimiter yes;        // Switch between 1D and mutliD limiters
    epsilon "5";                // VK constant
    limiterName vanAlbadaSlope; // vanAlbadaSlope, MinmodSlope, vanLeerSlope
}

relaxationFactors
{
    // Note: under-relaxation factors used in wave-transmissive schemes
    k               0.2;
    omega           0.2;
}

fieldBounds
{
    // With bounding
    p      2e4     6e5;
    rho    0.3     5.0;
    h      1e4     2e6;
    e      1e5     5e5;
    rhoE   5e4     1e6;
    T      10     1000;
    U      1000;
}

// ************************************************************************* //
